l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_twi.c
/*
 * Copyright (C) 2010 by Ulrich Prinz (uprinz2@netscape.net)
 * Copyright (C) 2010 by Rittal GmbH & Co. KG. All rights reserved.
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holders nor the names of
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
 * THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * For additional information see http://www.ethernut.de/
 *
 */

/*
 * \verbatim
 * $Id: stm32_twi.c 6367 2016-03-15 10:27:09Z u_bonnes $
 * \endverbatim
 */

#include <arch/cm3.h>
#include <dev/irqreg.h>

#include <sys/event.h>
#include <sys/atom.h>
#include <sys/timer.h>
#include <sys/thread.h>
#include <sys/heap.h>

#include <cfg/twi.h>
#include <dev/twif.h>
#include <stdlib.h>
#include <string.h>

#include <arch/cm3/stm/stm32xxxx.h>
#include <arch/cm3/stm/stm32_clk.h>
#if defined(I2CBUS1_USE_DMA) || defined(I2CBUS2_USE_DMA)
#if defined(MCU_STM32F1)
    #include <arch/cm3/stm/stm32f1_dma.h>
#else
#warning "Unhandled STM32 family"
#endif
#endif

//#define TWI_DEBUG

#ifdef TWI_DEBUG
#include <stdio.h>
#include <dev/gpio.h>
#define TPRINTF(...) printf(__VA_ARGS__); fflush(stdout)
#define DBGP1_INIT() GpioPinConfigSet(NUTGPIO_PORTB, 1, GPIO_CFG_OUTPUT)
#define DBGP1(v) GpioPinSet(NUTGPIO_PORTB, 1, v)
#define DBGP2_INIT() GpioPinConfigSet(NUTGPIO_PORTB, 9, GPIO_CFG_OUTPUT)
#define DBGP2(v) GpioPinSet(NUTGPIO_PORTB, 9, v)
#else
#define TPRINTF(...)
#define DBGP1_INIT()
#define DBGP1(v)
#define DBGP2_INIT()
#define DBGP2(v)
#endif


#define MODE_FLAG_Mask          ((uint32_t)0x00FFFFFF)
#define CR1_CLEAR_Mask          ((uint16_t)0xFBF5) /* I2C registers Masks */
#define CCR_CCR_Set             ((uint16_t)0x0FFF) /* I2C CCR mask */
#define CCR_FS_Set              ((uint16_t)0x8000) /* I2C F/S mask */

#define MODE_READ       1       /* Work as Receiver */
#define MODE_WRITE      0       /* Work as Transmitter */

#define ENABLE 1
#define DISABLE 0
#define ERROR 0
#define SUCCESS 1


/* Enable DMA trensfer mode at given bus */
inline void I2C_DMA_Enable(I2C_TypeDef* I2Cx){
    I2Cx->CR2 |= I2C_CR2_DMAEN;
};

/* Disable DMA trensfer mode at given bus */
inline void I2C_DMA_Disable(I2C_TypeDef* I2Cx){
    I2Cx->CR2 &= (uint16_t)~I2C_CR2_DMAEN;
};

/* Check if interface is busy */
inline uint8_t I2C_Is_Busy(I2C_TypeDef* I2Cx)
{
    return (uint8_t)(I2Cx->SR2&I2C_SR2_BUSY);
}

/* Answer with NACK to next received byte and set STOP */
#define I2C_NACK_STOP(x) { \
        x->CR1 &= (uint16_t)~I2C_CR1_ACK; \
        x->CR1 |= I2C_CR1_STOP; \
    }
#define I2C_ENA_ACK(x)  x->CR1 |= I2C_CR1_ACK

/* Send (RE-)START condition */
#define I2C_RESTART(x)  x->CR1 |= I2C_CR1_START

/* Send STOP after current transmission finished */
#define I2C_STOP(x)     x->CR1 |= I2C_CR1_STOP

/* Disable Event Interrupt */
#define I2C_DIS_EVT(x)  x->CR2 &= (uint16_t)~I2C_CR2_ITEVTEN

/* Control Buffer Interrupt */
#define I2C_DIS_BUF(x)  x->CR2 &= (uint16_t)~I2C_CR2_ITBUFEN
#define I2C_ENA_BUF(x)  x->CR2 |= I2C_CR2_ITBUFEN
/*
 * TWI Event & Data Interrupt Handler
 */
void TwEventIrq( void *arg)
{
    NUTTWIBUS *bus = arg;
    NUTTWIICB *icb = bus->bus_icb;
    I2C_TypeDef* I2Cx = (I2C_TypeDef*)bus->bus_base;
    uint32_t twsr1 = I2Cx->SR1;
    uint32_t twsr2 = I2Cx->SR2;
//    int i;

#if 0
    i=16;
    do {
        i--;
        DBGP1(1);
        DBGP2(twsr1&(1<<i));
        DBGP1(0);
    } while(i);
#endif

    if( twsr1 & I2C_SR1_SB) {
        /* Send Slave Address and direction bit */
        // TODO: 10-Bit Addressing
        I2Cx->DR = (icb->tw_mm_sla | icb->tw_mm_dir);
    }

    if( twsr2 & I2C_SR2_MSL)
    {
        DBGP1(1);
        /* Interface is in master mode */

        if( twsr1 & I2C_SR1_ADDR) {
            /*
             * This Section is called only after
             * Slave Address has been sent
             */
            if( icb->tw_mm_dir == MODE_WRITE) {
                /*
                 * Master Transmitter 1st Byte
                 */
                if( icb->tw_mm_iadrlen) {
                    /* we have to send a register address to the slave */
                    /* little-endian machine! */
                    I2Cx->DR = *icb->tw_mm_iadr--;
                    icb->tw_mm_iadrlen--;
                }
                else if( icb->tw_mm_txlen) {
                    /* we have to send data */
                    I2Cx->DR = *icb->tw_mm_txbuf++;
                    icb->tw_mm_txlen--;
                }

                /* If there was only one byte to send */
                if( (icb->tw_mm_txlen==0) && (icb->tw_mm_iadrlen==0)) {
                    /* Disable TXE Interrupt */
                    I2C_DIS_BUF(I2Cx);
                }
            }
            else {
                /*
                 * Master Receiver if only one byte awaited
                 */
                /* Check if only one byte to read */
                if( icb->tw_mm_rxlen == 1) {
                    /* Last byte awaited: send NACK and STOP */
                    I2C_NACK_STOP(I2Cx);
                }
            }
            goto TwEvExit;
        }


