l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_twi.c
        /*
         * Master in transmission 2nd to last byte
         */
        if( (twsr1 & (I2C_SR1_TXE|I2C_SR1_BTF)) == I2C_SR1_TXE) {
            if( icb->tw_mm_iadrlen) {
                /* send next register address byte */
                /* little-endian machine! */
                I2Cx->DR = *icb->tw_mm_iadr--;
                icb->tw_mm_iadrlen--;
            }
            else if( icb->tw_mm_txlen) {
                /* send next data byte */
                I2Cx->DR = *icb->tw_mm_txbuf++;
                icb->tw_mm_txlen--;
            }
            /* Check if end of tx */
            if( (icb->tw_mm_txlen==0) && (icb->tw_mm_iadrlen==0)) {
                /* Nothing left to send */
                I2C_DIS_BUF(I2Cx);
            }
            goto TwEvExit;
        }

        /*
         * Master transmitted last byte
         */
        if( (twsr1 & (I2C_SR1_TXE|I2C_SR1_BTF)) == (I2C_SR1_TXE|I2C_SR1_BTF)) {
            /* Check if Write->Read transition */
            if( icb->tw_mm_rxlen) {
                /* Switch to read direction */
                icb->tw_mm_dir = MODE_READ;
                /* Issue a RESTART */
                I2C_RESTART(I2Cx);
                /* Enable Buffer Interrupt again */
                I2C_ENA_BUF(I2Cx);
            }
            else {
                /* We are complete: Clear ACK, send STOP */
                I2C_NACK_STOP(I2Cx);
                /* Disable EV_IT */
                I2C_DIS_EVT(I2Cx);
            }
            goto TwEvExit;
        }

        /*
         * Master is receiving
         */
        if( twsr1 & I2C_SR1_RXNE) {
            /* Read data */
            *icb->tw_mm_rxbuf++ = (uint8_t)I2Cx->DR;
            icb->tw_mm_rxlen--;
            if( icb->tw_mm_rxlen == 1) {
                /* Only one byte left to receive: Clear ACK, set STOP */
                I2C_NACK_STOP(I2Cx);
            }
            if( icb->tw_mm_rxlen == 0) {
                /* Only one byte left to receive: Clear ACK, set STOP */
                I2C_DIS_BUF(I2Cx);
                goto TwEvExit;
            }
            goto TwEvExit;
        }
    }
    else {
        /* Slave mode */
        I2C_DIS_BUF(I2Cx);
        I2C_DIS_EVT(I2Cx);
        DBGP2(1);
    }

TwEvExit:
   DBGP2(0);
   DBGP1(0);
}


void TwErrorIrq( void *arg)
{
    NUTTWIBUS *bus = arg;
    NUTTWIICB *icb = bus->bus_icb;
    I2C_TypeDef* I2Cx = (I2C_TypeDef*)bus->bus_base;
    register uint32_t twsr1 = (I2Cx->SR1);

    /*
     *** ERROR HANDLING ***
     */
    if( twsr1 & I2C_SR1_AF) {
        /* Acknowledge failed */
        I2Cx->SR1 &= (uint16_t)~I2C_SR1_AF;
        icb->tw_mm_err = TWERR_SLA_NACK;
        I2C_STOP(I2Cx);
    }
    if( twsr1 & I2C_SR1_ARLO) {
        /* Arbitration lost */
        I2Cx->SR1 &= (uint16_t)~I2C_SR1_ARLO;
        icb->tw_mm_err = TWERR_ARBLOST;
    }
    if( twsr1 & I2C_SR1_BERR) {
        /* Misplaced Start/STOP condition detected */
        I2Cx->SR1 &= (uint16_t)~I2C_SR1_BERR;
        icb->tw_mm_err = TWERR_BUS;
    }
    if( twsr1 & I2C_SR1_TIMEOUT) {
        /* Timeout occured */
        I2Cx->SR1 &= (uint16_t)~I2C_SR1_TIMEOUT;
        icb->tw_mm_err = TWERR_TIMEOUT;
    }
    if( twsr1 & I2C_SR1_OVR) {
        /* Overrun/Underrun detected */
        I2Cx->SR1 &= (uint16_t)~I2C_SR1_OVR;
        icb->tw_mm_err = TWERR_OVRE;
    }
}


/*!
 * \brief Reset the I2C peripheral by issueing soft-reset.
 */
void NutTwiSoftReset( NUTTWIBUS *bus)
{
    I2C_TypeDef* I2Cx = (I2C_TypeDef*)bus->bus_base;
    I2Cx->CR1 |= I2C_CR1_SWRST;
    I2Cx->CR1 &= ~I2C_CR1_SWRST;
}

int TwWaitForFlag( volatile uint32_t *reg, uint32_t mask, uint16_t flag)
{
    int ret = 0;
    uint32_t sptout = 0xFFFF;
    while( (*(volatile uint16_t*)reg & mask) != flag) {
        if (sptout-- == 0) {
            ret = TWERR_SPCTOUT;
            break;
        }
    }
    return ret;
}

#if 0
int TwWaitBusFree( NUTTWIBUS *bus)
{
    int ret = -1;
    uint32_t tout = 100;
    NUTTWIICB *icb = bus->bus_icb;
    I2C_TypeDef* I2Cx = (I2C_TypeDef*)bus->bus_base;

    /* Wait till last transfer finished */
    tout = 100;
    while (I2C_Is_Busy(I2Cx) && tout) {
        TPRINTF("B");
        NutSleep(1);
        tout--;
    }
    if (tout) {
        /* Interface released in time */
        ret = 0;
    }
    else {
        TPRINTF("R");
        I2Cx->CR1 &= ~I2C_CR1_PE;
        I2Cx->CR1 |= I2C_CR1_SWRST;
        bus->bus_recover();
        I2Cx->CR1 &= ~I2C_CR1_SWRST;
        I2Cx->CR1 &= ~I2C_CR1_PE;
        NutSleep(1);
        if (I2C_Is_Busy(I2Cx)) {
            /* Bus still blocked */
            icb->tw_mm_error = TWERR_BUS;
            /* Release the interface. */
            NutEventPost( &bus->bus_mutex );
        }
        else {
            /* We made it! */
            ret = 0;
        }
    }
    return ret;
}
#endif

/*!
 * \brief Set START condition and wait for its appearance on the bus.
 */
void NutTwiStartRolling( NUTTWIBUS *bus, uint32_t tmo)
{
    int ret = 0;
    uint32_t tout = tmo;
    NUTTWIICB *icb = bus->bus_icb;
    I2C_TypeDef* I2Cx = (I2C_TypeDef*)bus->bus_base;

    /* Enable Interrupts */
    I2Cx->CR2 |= (I2C_CR2_ITEVTEN|I2C_CR2_ITBUFEN|I2C_CR2_ITERREN);
    /* Generate Start gets Irq System rolling */
    I2Cx->CR1 = (I2C_CR1_ACK|I2C_CR1_START|I2C_CR1_PE);
    /* Wait till the START has been sent */
    ret = TwWaitForFlag(&I2Cx->CR1, I2C_CR1_START, I2C_CR1_START);

    /* Continue only if START has been sent */
    if (ret == 0) {
        /* Go to background till we are through */
        while( I2C_Is_Busy(I2Cx)) {
//        while( icb->tw_mm_rxlen+icb->tw_mm_txlen) {
            NutSleep(1);
            if( tout-- == 0) {
                ret = TWERR_TIMEOUT;
                break;
            }
        }
        // TODO: Go back into Slave Mode
        I2Cx->CR1 |= I2C_CR1_ACK;
    }
    else
        icb->tw_mm_err |= ret;
    return;
}

/*!
 * \brief Transmit and/or receive data as a master.
 *
 * The two-wire serial interface must have been initialized by calling
 * TwInit() before this function can be used.
 *
 * \param sla    Slave address of the destination. This slave address
 *               must be specified as a 7-bit address. For example, the
 *               PCF8574A may be configured to slave addresses from 0x38
 *               to 0x3F.
 * \param txdata Points to the data to transmit. Ignored, if the number
 *               of data bytes to transmit is zero.
 * \param txlen  Number of data bytes to transmit. If zero, then the
 *               interface will not send any data to the slave device
 *               and will directly enter the master receive mode.
 * \param rxdata Points to a buffer, where the received data will be
 *               stored. Ignored, if the maximum number of bytes to
 *               receive is zero.
 * \param rxsiz  Maximum number of bytes to receive. Set to zero, if
 *               no bytes are expected from the slave device.
 * \param tmo    Timeout in milliseconds. To disable timeout, set this
 *               parameter to NUT_WAIT_INFINITE.
 *
 * \return The number of bytes received, -1 in case of an error or timeout.
 */
int NutTwiMasterTranceive( NUTTWIBUS  *bus,
                           uint8_t    sla,
                           const void *txdata, uint16_t txlen,
                           void       *rxdata, uint16_t rxsiz,
                           uint32_t   tmo )
{
    int rc = -1;
    NUTTWIICB *icb = bus->bus_icb;

//    TPRINTF( "TMT ");

    /* This routine is marked reentrant, so lock the interface. */
    if( NutEventWait( &bus->bus_mutex, tmo ) ) {
        icb->tw_mm_error = TWERR_IF_LOCKED;
        TPRINTF("! mtx=LOCKED... OUT\n");
        return rc;
    }

