l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_twi.c
#if 0
    /* Check if bus is blocked for any reason */
    if (TwWaitBusFree( bus))
    {
        return rc;
    }
#endif

    /* Clear errors. */
    icb->tw_mm_err = 0;
    /* fetch transfer parameters for current transaction */
    icb->tw_mm_sla = sla<<1;
    icb->tw_mm_iadr = NULL;
    icb->tw_mm_iadrlen = 0;
    icb->tw_mm_txbuf = (uint8_t*)txdata;
    icb->tw_mm_txlen = txlen;
    icb->tw_mm_rxbuf = rxdata;
    icb->tw_mm_rxlen = rxsiz;
    icb->tw_mm_err = 0;

    if (icb->tw_mm_rxlen)
        icb->tw_mm_dir = MODE_READ;
    else
        icb->tw_mm_dir = MODE_WRITE;

    /* Issue start and wait till transmission completed */
    NutTwiStartRolling( bus, tmo);

    /* Check for errors that may have been detected
     * by the interrupt routine.
     */
    if( icb->tw_mm_err ) {
        icb->tw_mm_error = icb->tw_mm_err;
        rc = -1;
        /* Soft-Reset this Bus */
        // NutTwiSoftReset( bus);
    } else {
        if( rxsiz)
            rc = (int)(rxsiz - icb->tw_mm_rxlen);
        else
            rc = (int)(txlen - icb->tw_mm_txlen);
    }

    /* Release the interface. */
    NutEventPost( &bus->bus_mutex );
    TPRINTF( "* Bye rc=%d\n", rc);

    return rc;
}

/*!
 * \brief Receive data as a master from a device having internal addressable registers
 *
 * The two-wire serial interface must have been initialized by calling
 * TwInit() before this function can be used.
 *
 * \param sla     Slave address of the destination. This slave address
 *                must be specified as a 7-bit address. For example, the
 *                PCF8574A may be configured to slave addresses from 0x38
 *                to 0x3F.
 * \param iadr    Address send to the device to access certain registers
 *                or memory addresses of it.
 * \param iadrlen Number of bytes to send as address, maximum 3 bytes are
 *                supported from AT91SAM7
 * \param rxdata  Points to a buffer, where the received data will be
 *                stored.
 * \param rxsiz   Maximum number of bytes to receive.
 * \param tmo     Timeout in milliseconds. To disable timeout, set this
 *                parameter to NUT_WAIT_INFINITE.
 *
 * \return The number of bytes received, -1 in case of an error or timeout.
 */
int NutTwiMasterRegRead( NUTTWIBUS  *bus,
                     uint8_t sla,
                     uint32_t iadr, uint8_t iadrlen,
                     void *rxdata, uint16_t rxsiz,
                     uint32_t tmo )
{
    int rc = -1;
    NUTTWIICB *icb = bus->bus_icb;

//    TPRINTF( "TMRR ");

    /* Quit if nothing to do */
    if( rxsiz == 0 ) {
        TPRINTF("! rxs=0... OUT\n");
        return rc;
    }

    /* This routine is marked reentrant, so lock the interface. */
    if( NutEventWait( &bus->bus_mutex, tmo ) ) {
        icb->tw_mm_error = TWERR_IF_LOCKED;
        TPRINTF("! LOCKED... OUT\n");
        return rc;
    }
#if 0
    /* Check if bus is blocked for any reason */
    if (TwWaitBusFree( bus))
    {
        return rc;
    }
#endif
    /* Clear errors. */
    icb->tw_mm_err = 0;
    /* fetch transfer parameters for current transaction */
    icb->tw_mm_sla = sla<<1;
    icb->tw_mm_iadrlen = iadrlen;
    if( iadrlen) {
        /* little-endian machine! */
        icb->tw_mm_iadr = ((uint8_t*)&iadr)+iadrlen-1;
    }
    icb->tw_mm_txbuf = NULL;
    icb->tw_mm_txlen = 0;
    icb->tw_mm_rxbuf = rxdata;
    icb->tw_mm_rxlen = rxsiz;
    icb->tw_mm_dir = MODE_WRITE;
    icb->tw_mm_err = 0;

    /* Issue start and wait till transmission completed */
    NutTwiStartRolling( bus, tmo);

    /* Check for errors that may have been detected
     * by the interrupt routine.
     */
    if( icb->tw_mm_err ) {
        icb->tw_mm_error = icb->tw_mm_err;
        rc = -1;
        TPRINTF( "! Error 0x%d\n", icb->tw_mm_err);
        /* Soft-Reset this Bus */
        // NutTwiSoftReset( bus);
    }
    else {
        rc = (int)(rxsiz - icb->tw_mm_rxlen);
    }

    /* Release the interface. */
    NutEventPost( &bus->bus_mutex );
//    TPRINTF( "* Bye rc=%d\n", rc);

    return rc;
}

/*!
 * \brief Transmit data as a master to a device having internal addressable registers
 *
 * The two-wire serial interface must have been initialized by calling
 * TwInit() before this function can be used.
 *
 * \param sla     Slave address of the destination. This slave address
 *                must be specified as a 7-bit address. For example, the
 *                PCF8574A may be configured to slave addresses from 0x38
 *                to 0x3F.
 * \param iadr    Address send to the device to access certain registers
 *                or memory addresses of it.
 * \param iadrlen Number of bytes to send as address, maximum 3 bytes are
 *                supported from AT91SAM7
 * \param txdata  Points to a buffer, where the data to transmit will be
 *                stored.
 * \param txsiz   Maximum number of bytes to transmit.
 * \param tmo     Timeout in milliseconds. To disable timeout, set this
 *                parameter to NUT_WAIT_INFINITE.
 *
 * \return        The number of bytes transmitted, -1 in case of an error
 *                or timeout. Number could be less if slave end transmission
 *                with NAK.
 */

int NutTwiMasterRegWrite( NUTTWIBUS  *bus,
                          uint8_t sla,
                          uint32_t iadr, uint8_t iadrlen,
                          const void *txdata, uint16_t txsiz,
                          uint32_t tmo )
{
    int rc = -1;
    NUTTWIICB *icb = bus->bus_icb;

//    TPRINTF( "TMRW ");

    /* Quit if nothing to do */
    if( txsiz==0) {
        TPRINTF("! txs=0... OUT\n");
        return rc;
    }

    /* This routine is marked reentrant, so lock the interface. */
    if( NutEventWait( &bus->bus_mutex, tmo ) ) {
        icb->tw_mm_error = TWERR_IF_LOCKED;
        TPRINTF("! mtx=LOCKED... OUT\n");
        return rc;
    }
#if 0
    /* Check if bus is blocked for any reason */
    if (TwWaitBusFree( bus))
    {
        return rc;
    }
#endif
    /* Clear errors. */
    icb->tw_mm_err = 0;
    /* fetch transfer parameters for current transaction */
    icb->tw_mm_sla = sla<<1;
    icb->tw_mm_iadrlen = iadrlen;
    if( iadrlen) {
        /* little-endian machine! */
        icb->tw_mm_iadr = ((uint8_t*)&iadr)+iadrlen-1;
    }
    icb->tw_mm_txbuf = (uint8_t*)txdata;
    icb->tw_mm_txlen = txsiz;
    icb->tw_mm_rxbuf = 0;
    icb->tw_mm_rxlen = 0;
    icb->tw_mm_dir = MODE_WRITE;
    icb->tw_mm_err = 0;

    /* Issue start and wait till transmission completed */
    NutTwiStartRolling( bus, tmo);

