l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32_twi.c
    /* Check for errors that may have been detected
     * by the interrupt routine.
     */
    if( icb->tw_mm_err ) {
        icb->tw_mm_error = icb->tw_mm_err;
        rc = -1;
        TPRINTF( "! Error 0x%d\n", icb->tw_mm_err);
        /* Soft-Reset this Bus */
        // NutTwiSoftReset( bus);
    }
    else {
        rc = (int)(txsiz - icb->tw_mm_txlen);
    }

    /* Release the interface. */
    NutEventPost( &bus->bus_mutex );
//    TPRINTF( "* Bye rc=%d\n", rc);

    return rc;
}

/*!
 * \brief Get last master mode error.
 *
 * You may call this function to determine the specific cause
 * of an error after twi transaction failed.
 *
 */
int NutTwiMasterError(NUTTWIBUS *bus)
{
    int rc = bus->bus_icb->tw_mm_error;
    bus->bus_icb->tw_mm_error = 0;
    return rc;
}

/*!
 * \brief Listen for incoming data from a master.
 *
 * If this function returns without error, the bus is blocked. The caller
 * must immediately process the request and return a response by calling
 * TwSlaveRespond().
 *
 * \note Slave mode is not implemented in the STM32 driver.
 *       Thus the function always returns -1.
 *
 * \param sla    Points to a byte variable, which receives the slave
 *               address sent by the master. This can be used by the
 *               caller to determine whether the the interface has been
 *               addressed by a general call or its individual address.
 * \param rxdata Points to a data buffer where the received data bytes
 *               are stored.
 * \param rxsiz  Specifies the maximum number of data bytes to receive.
 * \param tmo    Timeout in milliseconds. To disable timeout,
 *               set this parameter to NUT_WAIT_INFINITE.
 *
 * \return The number of bytes received, -1 in case of an error or timeout.
 *
 */
int NutTwiSlaveListen(NUTTWIBUS *bus, uint8_t *sla, void *rxdata, uint16_t rxsiz, uint32_t tmo)
{
    return -1;
}

/*!
 * \brief Send response to a master.
 *
 * This function must be called as soon as possible after TwSlaveListen()
 * returned successfully, even if no data needs to be returned. Not doing
 * so will completely block the bus.
 *
 * \note Slave mode is not implemented in the STM32 driver.
 *       Thus the function always returns -1.
 *
 * \param txdata Points to the data to transmit. Ignored, if the
 *               number of bytes to transmit is zero.
 * \param txlen  Number of data bytes to transmit.
 * \param tmo    Timeout in milliseconds. To disable timeout,
 *               set this parameter to NUT_WAIT_INFINITE.
 *
 * \return The number of bytes transmitted, -1 in case of an error or timeout.
 */
extern int NutTwiSlaveRespond(NUTTWIBUS *bus, void *txdata, uint16_t txlen, uint32_t tmo)
{
    return -1;
}

/*!
 * \brief Get last slave mode error.
 *
 * You may call this function to determine the specific cause
 * of an error after TwSlaveListen() or TwSlaveRespond() failed.
 *
 * \return Error code or 0 if no error occurred.
 *
 * \note Slave mode is not implemented in the STM32 driver.
 *       Thus the function always returns TWERR_BUS.
 */
extern int NutTwiSlaveError(NUTTWIBUS *bus)
{
    return TWERR_BUS;
}

/*!
 * \brief Get last transfer results.
 *
 * \todo Do we really need this. It may not work with competing threads.
 * Answer: We really need this! It is bus dependand and is used by
 * EEPROM driver to determine the number of bytes transferred and
 * detection of EEPROM busy event (ACK-Polling).
 *
 * You may call this function to determine how many bytes where
 * transferred before the twi transaction failed.
 *
 */
uint16_t NutTwiIndexes( NUTTWIBUS *bus, uint8_t idx )
{
    NUTTWIICB *icb = bus->bus_icb;

    switch ( idx ) {
    case 0:
        return (uint16_t) icb->tw_mm_error;
    case 1:
        return (uint16_t) icb->tw_mm_rxlen;
    case 2:
        return (uint16_t) icb->tw_mm_txlen;
    default:
        return 0;
    }
}

/*!
 * \brief Set Speed of I2C Interface.
 *
 * Setup Interface Speed
 */
int NutTwiSetSpeed( NUTTWIBUS *bus, uint32_t speed)
{
    int rc = 0;

    register uint16_t ccr;
    I2C_TypeDef* I2Cx = (I2C_TypeDef*)bus->bus_base;
    uint32_t apbclk = NutClockGet(HWCLK_APB1);
    uint16_t frqrange = (uint16_t)(apbclk/1000000);
    uint16_t cr1 = I2Cx->CR1;

    /* Disable I2C peripheral */
    I2Cx->CR1 &= ~I2C_CR1_PE;

    /* sanity check */
    if( speed > 400000 ) {
        speed = 400000;
        rc = -1;
    }

    /* Configure speed in fast mode */
    if( speed > 100000 ) {
        /* calculate CCR value */
        ccr = (uint16_t)(apbclk/(speed*25));
        if( ccr == 0 ) {
            /* keep minimum allowed value */
            ccr = 0x0001;
        }
        /* Set DUTY bit and set F/S bit for fast mode */
        ccr |= (I2C_CCR_DUTY|I2C_CCR_FS);
        /* Set Maximum Rise Time for fast mode */
        I2Cx->TRISE = (uint16_t)(((frqrange*300)/1000)+1);
    }
    else {
        /* Standard mode speed calculate */
        ccr = (uint16_t)(apbclk/(speed<<1));
        /* Test if CCR value is under 0x4 */
        if( ccr < 4 ) {
            /* Set minimum allowed value */
            ccr = 4;
        }
        else if ( ccr > I2C_CCR_CCR ) {
            ccr = I2C_CCR_CCR;
        }
        /* Set Maximum Rise Time for standard mode */
        I2Cx->TRISE = frqrange+1;
    }
    /* Write CCR register */
    I2Cx->CCR = ccr;

    /* Restore the CR1 register */
    I2Cx->CR1 = cr1;

    return rc;
}

/*!
 * \brief Request Current Speed of I2C Interface.
 *
 */
uint32_t NutTwiGetSpeed( NUTTWIBUS *bus)
{
    uint32_t speed = 0;
    uint32_t ccr = 0;
    uint32_t apbclk = NutClockGet(HWCLK_APB1);
    I2C_TypeDef* I2Cx = (I2C_TypeDef*)bus->bus_base;

    ccr=I2Cx->CCR;

    if(ccr & I2C_CCR_FS) {
        /* High speed */
        speed=(int)(apbclk/(25UL*(ccr&I2C_CCR_CCR)));
    }
    else {
        /* Low speed */
        speed=(int)(apbclk/(2UL*(ccr&I2C_CCR_CCR)));
    }
    return speed;
}

/*!
 * \brief Perform TWI control functions.
 *
 * \param req  Requested control function. May be set to one of the
 *         following constants:
 *         - TWI_SETSPEED, if conf points to an uint32_t value containing the bitrate.
 *         - TWI_GETSPEED, if conf points to an uint32_t value receiving the current bitrate.
 * \param conf Points to a buffer that contains any data required for
 *         the given control function or receives data from that
 *         function.
 * \return 0 on success, -1 otherwise.
 *
 * \note Timeout is limited to the granularity of the system timer.
 *
 */
int NutTwiIOCtl( NUTTWIBUS *bus, int req, void *conf )
{
    int rc = 0;
    NUTTWIICB *icb = bus->bus_icb;

    switch (req)
    {
        case TWI_SETSPEED:
            NutTwiSetSpeed( bus, *(uint32_t*)conf);
            break;

